       PROCESS NODLL,NODYNAM,TEST(NOSEP),NOCICS,NOSQL,PGMN(LU)
      *+---------------------------------------------------------------+
      *| THCMADB0                                                      |
      *| PRODUCT: IBM DEVELOPER FOR Z/OS                               |
      *| COMPONENT: IBM Z/OS AUTOMATED UNIT TESTING FRAMEWORK (ZUNIT)  |
      *|   FOR ENTERPRISE COBOL AND PL/I                               |
      *| PROGRAM: ENTERPRISE COBOL ZUNIT TEST CASE FOR DYNAMIC RUNNER  |
      *| DATE GENERATED: 12/22/2020 13:35                              |
      *| ID: 28c366c3-5fb9-4750-a7a0-3e1d79855d73                      |
      *+---------------------------------------------------------------+
      *+---------------------------------------------------------------+
      *| TEST_TEST3                                                    |
      *|     THIS PROGRAM IS FOR TEST TEST3                            |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'TEST_TEST3'.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PROGRAM-NAME   PIC X(8)  VALUE 'HCMADB02'.
       01 BZ-ASSERT.
         03 MESSAGE-LEN PIC S9(4) COMP-4 VALUE 24.
         03 MESSAGE-TXT PIC X(254) VALUE 'HELLO FROM TEST CALLBACK'.
       01  BZ-P1 PIC S9(9) COMP-4 VALUE 4.
       01  BZ-P2 PIC S9(9) COMP-4 VALUE 2001.
       01  BZ-P3 PIC X(3) VALUE 'AZU'.
       01 BZ-TRACE.
         03 TRACE-LEN       PIC S9(4) COMP-4 VALUE 5.
         03 TRACE-TXT       PIC X(254) VALUE 'TRACE'.
       01 BZUASSRT          PIC X(8) VALUE 'BZUASSRT'.
       01 BZUTRACE          PIC X(8) VALUE 'BZUTRACE'.
       01 AZ-TRACE-PTR      POINTER.
       01 ASSERT-ST.
         03 ASSERT-RC PIC 9(9) BINARY VALUE 4.
         03 ASSERT-TEXT PIC 9(4) BINARY VALUE 0.
       01 AZ-TEST-NAME-LEN       PIC S9(9) COMP-5.
       1 AZ-TEST-EXPECTED-DATA-VALUE.
          3 ZUT00000000.
            5 PIC X(6) DISPLAY VALUE '01AMED'.
          3 ZUT00000001.
            5 PIC X(7) DISPLAY VALUE 'COVID78'.
            5 PIC X(43) DISPLAY VALUE SPACES.
          3 ZUT00000002.
            5 PIC X(4) DISPLAY VALUE '78MG'.
            5 PIC X(16) DISPLAY VALUE SPACES.
          3 ZUT00000003.
            5 PIC X(3) VALUE X'4040F0'.
          3 ZUT00000004.
            5 PIC X(20) DISPLAY VALUE SPACES.
          3 ZUT00000005.
            5 PIC X(20) DISPLAY VALUE SPACES.
          3 ZUT00000006.
            5 PIC X(20) DISPLAY VALUE SPACES.
          3 ZUT00000007.
            5 PIC X(2) DISPLAY VALUE SPACES.
          3 ZUT00000008.
            5 PIC X(10) DISPLAY VALUE '2020-12-01'.
          3 ZUT00000009.
            5 PIC X(10) DISPLAY VALUE '2020-12-30'.
          3 ZUT0000000A.
            5 PIC X(10) VALUE X'40000000004040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40000000004040404040'.
            5 PIC X(10) VALUE X'40404040404040004044'.
            5 PIC X(10) VALUE X'00001EC8C3C9D7C4C2F0'.
            5 PIC X(10) VALUE X'F11B08112F04CFB7F000'.
            5 PIC X(10) VALUE X'0121C31CA821C2FED821'.
            5 PIC X(10) VALUE X'C2FD10047400E7000000'.
            5 PIC X(10) VALUE X'F4000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00E2D8D3C4C14E400800'.
            5 PIC X(10) VALUE X'0001C8000A000A01C400'.
            5 PIC X(10) VALUE X'0A21C1C54C0000000000'.
            5 PIC X(10) VALUE X'08000004740000000040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'4001C4001421C1C55600'.
            5 PIC X(10) VALUE X'00000000080000047400'.
            5 PIC X(10) VALUE X'00000040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'404040404001C4000A21'.
            5 PIC X(10) VALUE X'C1C56A00000000000800'.
            5 PIC X(10) VALUE X'00047400000000404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404001'.
            5 PIC X(10) VALUE X'C4000A21C1C542000000'.
            5 PIC X(10) VALUE X'00000800000474000000'.
            5 PIC X(10) VALUE X'00404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404001C4001421C1C5'.
            5 PIC X(10) VALUE X'74000000000008000004'.
            5 PIC X(10) VALUE X'74000000004040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'4040404040404001C400'.
            5 PIC X(10) VALUE X'1421C1C5880000000000'.
            5 PIC X(10) VALUE X'08000004740000000040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'4001C4000A21C1C59C00'.
            5 PIC X(10) VALUE X'00000000080000047400'.
            5 PIC X(10) VALUE X'00000040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'404040404001C4001421'.
            5 PIC X(10) VALUE X'C1C5A600000000000800'.
            5 PIC X(10) VALUE X'00047400000000404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404001'.
            5 PIC X(10) VALUE X'C4003221C1C5BA000000'.
            5 PIC X(10) VALUE X'00000800000474000000'.
            5 PIC X(10) VALUE X'00404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404001C4000A21C1C5'.
            5 PIC X(10) VALUE X'EC000000000008000004'.
            5 PIC X(10) VALUE X'74000000004040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040E2D8D3'.
            5 PIC X(10) VALUE X'C4C14040080000003C00'.
            5 PIC X(10) VALUE X'01000101F0000421C31C'.
            5 PIC X(10) VALUE X'A0000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'404040E4F0F0F0F0F8F0'.
            5 PIC X(10) VALUE X'F800E86EC4C6C8C5C9E4'.
            5 PIC X(10) VALUE X'E2404040404040000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000021C30100000000'.
            5 PIC X(10) VALUE X'0021C308A00000000000'.
            5 PIC X(10) VALUE X'000000000000000008B9'.
            5 PIC X(10) VALUE X'14A28FF4282184142021'.
            5 PIC X(10) VALUE X'C3003C0004180021106D'.
            5 PIC X(10) VALUE X'3821A30D4021A311B421'.
            5 PIC X(10) VALUE X'102E5A21A313907F6529'.
            5 PIC X(10) VALUE X'4821A2D00021C3000821'.
            5 PIC X(10) VALUE X'BE3F54008C7000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000000000000021C300'.
            5 PIC X(10) VALUE X'3C21C300400000000000'.
            5 PIC X(10) VALUE X'00000000656EC4C6C8C1'.
            5 PIC X(10) VALUE X'D76DC4C6C8C5C9C25C01'.
            5 PIC X(10) VALUE X'51241C0120349FC2E9E4'.
            5 PIC X(10) VALUE X'C90000808C0000000000'.
            5 PIC X(10) VALUE X'0000000000000E080000'.
            5 PIC X(10) VALUE X'00000000C2E9E4E5C6C9'.
            5 PIC X(10) VALUE X'D3C5C4C6F0F0F0F2F0F3'.
            5 PIC X(10) VALUE X'40404040404040400000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0021C3004800000000A2'.
            5 PIC X(10) VALUE X'8FF7B200084E1A21C30A'.
            5 PIC X(10) VALUE X'8221C3090822D1890A21'.
            5 PIC X(10) VALUE X'106D380000000022D180'.
            5 PIC X(10) VALUE X'000000000022D1883C00'.
            5 PIC X(10) VALUE X'00000021A2D00021C301'.
            5 PIC X(10) VALUE X'00A28FF428008C700021'.
            5 PIC X(10) VALUE X'C308A000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000401BF36FFFF000000'.
            5 PIC X(10) VALUE X'0000000000E4F0F0F0F0'.
            5 PIC X(10) VALUE X'F8F0F8E4F0F0F0F0F8F0'.
            5 PIC X(10) VALUE X'F8000002120800000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000000000021C3004800'.
            5 PIC X(10) VALUE X'000000A28FF7B2000000'.
            5 PIC X(10) VALUE X'0021C30A8221C3090822'.
            5 PIC X(10) VALUE X'D1890A21106D38000000'.
            5 PIC X(10) VALUE X'0022D180000000000022'.
            5 PIC X(10) VALUE X'D1883C0000000021A2D0'.
            5 PIC X(10) VALUE X'0021C30100A28FF42800'.
            5 PIC X(10) VALUE X'8C700000000000000000'.
            5 PIC X(10) VALUE X'000000000021C308A000'.
            5 PIC X(10) VALUE X'8C700021C30100000000'.
            5 PIC X(10) VALUE X'0000000000A28FF85221'.
            5 PIC X(10) VALUE X'C30A7AA1C30A82228FF7'.
            5 PIC X(10) VALUE X'D4000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000A28FF7'.
            5 PIC X(10) VALUE X'D8000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'000000A1C30A20000000'.
            5 PIC X(10) VALUE X'00000000000000000022'.
            5 PIC X(10) VALUE X'D1883000000000000000'.
            5 PIC X(10) VALUE X'0000000000F0F5F0F4F0'.
            5 PIC X(10) VALUE X'F0C2E9E4C3C9F5F4F000'.
            5 PIC X(10) VALUE X'00807C00000000000000'.
            5 PIC X(10) VALUE X'00F0F0F8F0F7C8C3D4C1'.
            5 PIC X(10) VALUE X'C3D7F0F2C9C2D4E4E2C5'.
            5 PIC X(10) VALUE X'D9402112412196700000'.
            5 PIC X(10) VALUE X'0202034900000000C8C3'.
            5 PIC X(10) VALUE X'D4C1D7D3F0F1D8F8361A'.
            5 PIC X(10) VALUE X'AAA4C680000000000000'.
            5 PIC X(10) VALUE X'0000C3C9C3C2E9E4C3C9'.
            5 PIC X(10) VALUE X'C4D9C90008000C00CE00'.
            5 PIC X(10) VALUE X'85000000000000000000'.
            5 PIC X(10) VALUE X'0000000000E4F0F0F0F0'.
            5 PIC X(10) VALUE X'F8F0F840404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040400000000140'.
            5 PIC X(10) VALUE X'40404000004040404040'.
            5 PIC X(10) VALUE X'40000000024040404000'.
            5 PIC X(10) VALUE X'00000840404040000000'.
            5 PIC X(10) VALUE X'10404040400000002040'.
            5 PIC X(10) VALUE X'404040938440A3818293'.
            5 PIC X(10) VALUE X'85408486888589A38182'.
            5 PIC X(10) VALUE X'40F7F1F04B4040000000'.
            5 PIC X(10) VALUE X'0C404040400000404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040400000404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'404040404040404040C8'.
            5 PIC X(10) VALUE X'C3D4C1C3D7F0F2F0F0F0'.
            5 PIC X(10) VALUE X'F0F8F0F74021C1C53009'.
            5 PIC X(10) VALUE X'C4C8C3C1E9C5D9D9E200'.
            5 PIC X(10) VALUE X'00000040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040C8C3D7'.
            5 PIC X(10) VALUE X'F1C2C9F0F140D7D5E4D4'.
            5 PIC X(10) VALUE X'7EF0F0F0F0F0F0F0F0F0'.
            5 PIC X(10) VALUE X'F140D4D5E4D47E404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040E2D8D3C3D6C4'.
            5 PIC X(10) VALUE X'C57E40404040404040C3'.
            5 PIC X(10) VALUE X'D6D4D4C1D9C5C17E4040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'4040400012F0F0F1C840'.
            5 PIC X(10) VALUE X'400000000140404040E2'.
            5 PIC X(10) VALUE X'D8D3C3C1404040000000'.
            5 PIC X(10) VALUE X'88000000000000404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040C4E2D5'.
            5 PIC X(10) VALUE X'40404040400000000000'.
            5 PIC X(10) VALUE X'00000000000000FFFFFF'.
            5 PIC X(10) VALUE X'FF0000000000000000E6'.
            5 PIC X(10) VALUE X'E6404040404040404040'.
            5 PIC X(10) VALUE X'F0F1F0F0F4C5D5C460D4'.
            5 PIC X(10) VALUE X'C2D3D2E4F0F0F0F0F8F0'.
            5 PIC X(10) VALUE X'F7E4F0F0F0F0F8F0F700'.
            5 PIC X(10) VALUE X'007F8CC3C9C3E2000000'.
            5 PIC X(10) VALUE X'12C9D5D7E30101C8C3C9'.
            5 PIC X(10) VALUE X'D7C4C2F0F1000000EFC5'.
            5 PIC X(10) VALUE X'C9C24000000055015124'.
            5 PIC X(10) VALUE X'1C0120349FC8C3D4C100'.
            5 PIC X(10) VALUE X'00807CC3D7F0F2000001'.
            5 PIC X(10) VALUE X'587EF47D0E0800000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000004040'.
            5 PIC X(10) VALUE X'40404040404000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000C100000000000009'.
            5 PIC X(10) VALUE X'0E0800000700001000C3'.
            5 PIC X(10) VALUE X'D4C14000007EF4F0F1C9'.
            5 PIC X(10) VALUE X'D7C1E3F0F0F0F0F0F0F0'.
            5 PIC X(10) VALUE X'F0F0F0F0F1F9F6F2F7F8'.
            5 PIC X(10) VALUE X'F1F1F2F3F4D981939788'.
            5 PIC X(10) VALUE X'4040404040C4C1939485'.
            5 PIC X(10) VALUE X'89848140404040404040'.
            5 PIC X(10) VALUE X'4040404040F1F9F8F060'.
            5 PIC X(10) VALUE X'F0F760F1F1F3F440D481'.
            5 PIC X(10) VALUE X'899540E2A3998585A340'.
            5 PIC X(10) VALUE X'4040404040E396999695'.
            5 PIC X(10) VALUE X'A3964040404040404040'.
            5 PIC X(10) VALUE X'4040404040D4F5C840F1'.
            5 PIC X(10) VALUE X'E3F1404040F0F7F760F1'.
            5 PIC X(10) VALUE X'F2F360F9F9F8F7404040'.
            5 PIC X(10) VALUE X'4040404040D981939788'.
            5 PIC X(10) VALUE X'C47C8982944B83969440'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040409981939788'.
            5 PIC X(10) VALUE X'84404040404040404040'.
            5 PIC X(10) VALUE SPACES.
            5 PIC X(14857)  VALUE SPACES.
       01 AZ-COMPARE.
         03 AZ-COMPARE-ITEM-NAME-PTR  POINTER.
         03 AZ-COMPARE-ITEM-NAME-LEN  PIC S9(9) COMP-5.
         03 AZ-COMPARE-ITEM-VALUE-PTR POINTER.
         03 AZ-COMPARE-ITEM-VALUE-LEN PIC S9(9) COMP-5.
         03 AZ-COMPARE-ITEM-EXP-VALUE-PTR POINTER.
         03 AZ-COMPARE-ITEM-EXP-VALUE-LEN PIC S9(9) COMP-5.
       LOCAL-STORAGE SECTION.
       1 AZ-COMPARE-ITEM-NAMES.
         3 ZUT0000000B.
            5 PIC X(20) DISPLAY VALUE 'CA-REQUEST-ID OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT0000000D.
            5 PIC X(20) DISPLAY VALUE 'CA-RETURN-CODE OF DF'.
            5 PIC X(9) DISPLAY VALUE 'HCOMMAREA'.
         3 ZUT0000000F.
            5 PIC X(20) DISPLAY VALUE 'CA-PATIENT-ID OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT00000011.
            5 PIC X(20) DISPLAY VALUE 'CA-DRUG-NAME OF CA-M'.
            5 PIC X(20) DISPLAY VALUE 'EDICATION-REQUEST OF'.
            5 PIC X(12) DISPLAY VALUE ' DFHCOMMAREA'.
         3 ZUT00000013.
            5 PIC X(20) DISPLAY VALUE 'CA-STRENGTH OF CA-ME'.
            5 PIC X(20) DISPLAY VALUE 'DICATION-REQUEST OF '.
            5 PIC X(11) DISPLAY VALUE 'DFHCOMMAREA'.
         3 ZUT00000015.
            5 PIC X(20) DISPLAY VALUE 'CA-AMOUNT OF CA-MEDI'.
            5 PIC X(20) DISPLAY VALUE 'CATION-REQUEST OF DF'.
            5 PIC X(9) DISPLAY VALUE 'HCOMMAREA'.
         3 ZUT00000017.
            5 PIC X(20) DISPLAY VALUE 'CA-ROUTE OF CA-MEDIC'.
            5 PIC X(20) DISPLAY VALUE 'ATION-REQUEST OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT00000019.
            5 PIC X(20) DISPLAY VALUE 'CA-FREQUENCY OF CA-M'.
            5 PIC X(20) DISPLAY VALUE 'EDICATION-REQUEST OF'.
            5 PIC X(12) DISPLAY VALUE ' DFHCOMMAREA'.
         3 ZUT0000001B.
            5 PIC X(20) DISPLAY VALUE 'CA-IDENTIFIER OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'MEDICATION-REQUEST O'.
            5 PIC X(13) DISPLAY VALUE 'F DFHCOMMAREA'.
         3 ZUT0000001D.
            5 PIC X(20) DISPLAY VALUE 'CA-BIOMED-TYPE OF CA'.
            5 PIC X(20) DISPLAY VALUE '-MEDICATION-REQUEST '.
            5 PIC X(14) DISPLAY VALUE 'OF DFHCOMMAREA'.
         3 ZUT0000001F.
            5 PIC X(20) DISPLAY VALUE 'CA-START-DATE OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'MEDICATION-REQUEST O'.
            5 PIC X(13) DISPLAY VALUE 'F DFHCOMMAREA'.
         3 ZUT00000021.
            5 PIC X(20) DISPLAY VALUE 'CA-END-DATE OF CA-ME'.
            5 PIC X(20) DISPLAY VALUE 'DICATION-REQUEST OF '.
            5 PIC X(11) DISPLAY VALUE 'DFHCOMMAREA'.
         3 ZUT00000023.
            5 PIC X(20) DISPLAY VALUE 'CA-PRESCRIPTION-ID O'.
            5 PIC X(20) DISPLAY VALUE 'F CA-MEDICATION-REQU'.
            5 PIC X(18) DISPLAY VALUE 'EST OF DFHCOMMAREA'.
         3 ZUT00000025.
            5 PIC X(20) DISPLAY VALUE 'CA-ADDITIONAL-DATA O'.
            5 PIC X(20) DISPLAY VALUE 'F CA-MEDICATION-REQU'.
            5 PIC X(18) DISPLAY VALUE 'EST OF DFHCOMMAREA'.
       1 AZ-COMPARE-WORK-ITEMS.
          3 ZUT0000000C PIC X(6) OCCURS 2.
          3 ZUT0000000E PIC 9(2) OCCURS 2.
          3 ZUT00000010 PIC 9(10) OCCURS 2.
          3 ZUT00000012 PIC X(50) OCCURS 2.
          3 ZUT00000014 PIC X(20) OCCURS 2.
          3 ZUT00000016 PIC X(6) OCCURS 2.
          3 ZUT00000018 PIC X(20) OCCURS 2.
          3 ZUT0000001A PIC X(20) OCCURS 2.
          3 ZUT0000001C PIC X(20) OCCURS 2.
          3 ZUT0000001E PIC X(2) OCCURS 2.
          3 ZUT00000020 PIC X(10) OCCURS 2.
          3 ZUT00000022 PIC X(10) OCCURS 2.
          3 ZUT00000024 PIC 9(10) OCCURS 2.
          3 ZUT00000026 PIC X(64634) OCCURS 2.
       01 AZ-CONVERT.
         03 AZ-CONVERT-HEXIN  PIC X(1).
         03 AZ-CONVERT-HEXVAL PIC X(2).
         03 AZ-HEXSTR PIC X(16) VALUE "0123456789ABCDEF".
         03 AZ-DEC  PIC S9(4) COMP VALUE 0.
         03 FILLER REDEFINES AZ-DEC.
           05 FILLER PIC X.
           05 AZ-DECBYTE PIC X.
         03 AZ-I PIC S9(8) COMP.
         03 AZ-J PIC S9(8) COMP.
         03 AZ-Q PIC S9(8) COMP.
         03 AZ-R PIC S9(8) COMP.
         03 AZ-Q1 PIC S9(8) COMP.
         03 AZ-R1 PIC S9(8) COMP.
       LINKAGE SECTION.
       01 AZ-TEST                   PIC X(80).
       01 AZ-ARG-LIST.
         03 ARG-LENGTH PIC 9(4) COMP-4.
         03 ARG-DATA PIC X(256).
       01 AZ-COMPARE-ITEM-NAME      PIC X(254).
       01 AZ-COMPARE-ITEM-VALUE     PIC X(254).
       01 AZ-COMPARE-ITEM-EXP-VALUE PIC X(254).
       1 DFHEIBLK.
         2 EIBTIME PICTURE S9(7) USAGE COMPUTATIONAL-3.
         2 EIBDATE PICTURE S9(7) USAGE COMPUTATIONAL-3.
         2 EIBTRNID PICTURE X(4).
         2 EIBTASKN PICTURE S9(7) USAGE COMPUTATIONAL-3.
         2 EIBTRMID PICTURE X(4).
         2 DFHEIGDI PICTURE S9(4) USAGE COMPUTATIONAL-5.
         2 EIBCPOSN PICTURE S9(4) USAGE COMPUTATIONAL-5.
         2 EIBCALEN PICTURE S9(4) USAGE COMPUTATIONAL-5.
         2 EIBAID PICTURE X(1).
         2 EIBFN PICTURE X(2).
         2 EIBRCODE PICTURE X(6).
         2 EIBDS PICTURE X(8).
         2 EIBREQID PICTURE X(8).
         2 EIBRSRCE PICTURE X(8).
         2 EIBSYNC PICTURE X.
         2 EIBFREE PICTURE X.
         2 EIBRECV PICTURE X.
         2 EIBSEND PICTURE X.
         2 EIBATT PICTURE X.
         2 EIBEOC PICTURE X.
         2 EIBFMH PICTURE X.
         2 EIBCOMPL PICTURE X(1).
         2 EIBSIG PICTURE X(1).
         2 EIBCONF PICTURE X(1).
         2 EIBERR PICTURE X(1).
         2 EIBERRCD PICTURE X(4).
         2 EIBSYNRB PICTURE X.
         2 EIBNODAT PICTURE X.
         2 EIBRESP PICTURE S9(8) USAGE COMPUTATIONAL.
         2 EIBRESP2 PICTURE S9(8) USAGE COMPUTATIONAL.
         2 EIBRLDBK PICTURE X(1).
       1 DFHCOMMAREA.
         3 CA-REQUEST-ID PIC X(6).
         3 CA-RETURN-CODE PIC 9(2).
         3 CA-PATIENT-ID PIC 9(10).
         3 CA-REQUEST-SPECIFIC PIC X(32482).
         3 CA-PATIENT-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-INS-CARD-NUM PIC X(10).
         5 CA-FIRST-NAME PIC X(10).
         5 CA-LAST-NAME PIC X(20).
         5 CA-DOB PIC X(10).
         5 CA-ADDRESS PIC X(20).
         5 CA-CITY PIC X(20).
         5 CA-POSTCODE PIC X(10).
         5 CA-PHONE-MOBILE PIC X(20).
         5 CA-EMAIL-ADDRESS PIC X(50).
         5 CA-USERID PIC X(10).
         5 CA-ADDITIONAL-DATA PIC X(32302).
         3 CA-PATIENT-USER-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-USERNAME PIC X(10).
         5 CA-USERPASSWORD PIC X(14).
         5 CA-ADDITIONAL-DATA PIC X(32458).
         3 CA-MEDICATION-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-DRUG-NAME PIC X(50).
         5 CA-STRENGTH PIC X(20).
         5 CA-AMOUNT PIC 9(03).
          5 CA-AMOUNT-AZ REDEFINES CA-AMOUNT.
          6 PIC X(3) DISPLAY.
         5 CA-ROUTE PIC X(20).
         5 CA-FREQUENCY PIC X(20).
         5 CA-IDENTIFIER PIC X(20).
         5 CA-BIOMED-TYPE PIC X(2).
         5 CA-START-DATE PIC X(10).
         5 CA-END-DATE PIC X(10).
         5 CA-PRESCRIPTION-ID PIC 9(10).
         5 CA-ADDITIONAL-DATA PIC X(32317).
          5 CA-ADDITIONAL-DATA-AZ REDEFINES CA-ADDITIONAL-DATA.
          6 PIC X(32317) DISPLAY.
         3 CA-MEDITATION-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-MEDITATION-NAME PIC X(50).
         5 CA-MEDITATION-TYPE PIC X(20).
         5 CA-RELIEF PIC X(20).
         5 CA-POSTURE PIC X(20).
         5 CA-HOW-OFTEN PIC X(20).
         5 CA-ADDITIONAL-DATA PIC X(32352).
         3 CA-THRESHOLD-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-HR-THRESHOLD PIC X(10).
         5 CA-BP-THRESHOLD PIC X(10).
         5 CA-MS-THRESHOLD PIC X(10).
         5 CA-ADDITIONAL-DATA PIC X(32452).
         3 CA-VISIT-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-VISIT-DATE PIC X(10).
         5 CA-VISIT-TIME PIC X(10).
         5 CA-HEART-RATE PIC X(10).
         5 CA-BLOOD-PRESSURE PIC X(10).
         5 CA-MENTAL-STATE PIC X(10).
         5 CA-ADDITIONAL-DATA PIC X(32432).
       PROCEDURE DIVISION USING AZ-TEST
           DFHEIBLK DFHCOMMAREA.
      * START
           DISPLAY 'TEST_TEST3 STARTED...'
           MOVE 0 TO AZ-TEST-NAME-LEN.
           INSPECT AZ-TEST TALLYING AZ-TEST-NAME-LEN FOR
           CHARACTERS BEFORE INITIAL SPACE.
      * INITIALIZE PARAMETER
           PERFORM INITIALIZE-PARM
      * SET AREA ADDRESS TO POINTER
      * SET INPUT VALUE
           MOVE 0 TO RETURN-CODE.
      * CALL TEST PROGRAM
           DISPLAY 'CALL HCMADB02'
           CALL PROGRAM-NAME
           USING DFHEIBLK DFHCOMMAREA
           .
      * EVALUATE OUTPUT VALUE
           MOVE 0 TO RETURN-CODE
           IF CA-REQUEST-ID OF DFHCOMMAREA = ZUT00000000 THEN
             CONTINUE
           ELSE
             MOVE CA-REQUEST-ID OF DFHCOMMAREA TO ZUT0000000C(1)
             MOVE ZUT00000000 TO ZUT0000000C(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000000B
             MOVE LENGTH OF ZUT0000000B TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT0000000C(1)
             MOVE 6 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000000C(2)
             MOVE 6 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF (CA-RETURN-CODE OF DFHCOMMAREA IS NUMERIC)
               AND (CA-RETURN-CODE OF DFHCOMMAREA = 0) THEN
             CONTINUE
           ELSE
             MOVE CA-RETURN-CODE OF DFHCOMMAREA TO ZUT0000000E(1)
             MOVE 0 TO ZUT0000000E(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000000D
             MOVE LENGTH OF ZUT0000000D TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT0000000E(1)
             MOVE 2 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000000E(2)
             MOVE 2 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF (CA-PATIENT-ID OF DFHCOMMAREA IS NUMERIC)
               AND (CA-PATIENT-ID OF DFHCOMMAREA = 1) THEN
             CONTINUE
           ELSE
             MOVE CA-PATIENT-ID OF DFHCOMMAREA TO ZUT00000010(1)
             MOVE 1 TO ZUT00000010(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000000F
             MOVE LENGTH OF ZUT0000000F TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000010(1)
             MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000010(2)
             MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-DRUG-NAME OF CA-MEDICATION-REQUEST OF DFHCOMMAREA =
           ZUT00000001 THEN
             CONTINUE
           ELSE
             MOVE CA-DRUG-NAME OF CA-MEDICATION-REQUEST OF DFHCOMMAREA
           TO ZUT00000012(1)
             MOVE ZUT00000001 TO ZUT00000012(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000011
             MOVE LENGTH OF ZUT00000011 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000012(1)
             MOVE 50 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000012(2)
             MOVE 50 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-STRENGTH OF CA-MEDICATION-REQUEST OF DFHCOMMAREA =
           ZUT00000002 THEN
             CONTINUE
           ELSE
             MOVE CA-STRENGTH OF CA-MEDICATION-REQUEST OF DFHCOMMAREA
           TO ZUT00000014(1)
             MOVE ZUT00000002 TO ZUT00000014(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000013
             MOVE LENGTH OF ZUT00000013 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000014(1)
             MOVE 20 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000014(2)
             MOVE 20 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-AMOUNT-AZ OF CA-MEDICATION-REQUEST OF DFHCOMMAREA =
           ZUT00000003 THEN
             CONTINUE
           ELSE
             PERFORM VARYING AZ-I FROM 1 BY 1 UNTIL AZ-I > 3
               MOVE CA-AMOUNT-AZ OF CA-MEDICATION-REQUEST OF
           DFHCOMMAREA(AZ-I:1) TO AZ-CONVERT-HEXIN
               PERFORM CONVERT
               COMPUTE AZ-J = AZ-I * 2 - 1
               MOVE AZ-CONVERT-HEXVAL TO ZUT00000016(1)(AZ-J:2)
             END-PERFORM
             PERFORM VARYING AZ-I FROM 1 BY 1 UNTIL AZ-I > 3
               MOVE ZUT00000003(AZ-I:1) TO AZ-CONVERT-HEXIN
               PERFORM CONVERT
               COMPUTE AZ-J = AZ-I * 2 - 1
               MOVE AZ-CONVERT-HEXVAL TO ZUT00000016(2)(AZ-J:2)
             END-PERFORM
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000015
             MOVE LENGTH OF ZUT00000015 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000016(1)
             MOVE 6 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000016(2)
             MOVE 6 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-ROUTE OF CA-MEDICATION-REQUEST OF DFHCOMMAREA =
           ZUT00000004 THEN
             CONTINUE
           ELSE
             MOVE CA-ROUTE OF CA-MEDICATION-REQUEST OF DFHCOMMAREA TO
           ZUT00000018(1)
             MOVE ZUT00000004 TO ZUT00000018(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000017
             MOVE LENGTH OF ZUT00000017 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000018(1)
             MOVE 20 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000018(2)
             MOVE 20 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-FREQUENCY OF CA-MEDICATION-REQUEST OF DFHCOMMAREA =
           ZUT00000005 THEN
             CONTINUE
           ELSE
             MOVE CA-FREQUENCY OF CA-MEDICATION-REQUEST OF DFHCOMMAREA
           TO ZUT0000001A(1)
             MOVE ZUT00000005 TO ZUT0000001A(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000019
             MOVE LENGTH OF ZUT00000019 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT0000001A(1)
             MOVE 20 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000001A(2)
             MOVE 20 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-IDENTIFIER OF CA-MEDICATION-REQUEST OF DFHCOMMAREA =
           ZUT00000006 THEN
             CONTINUE
           ELSE
             MOVE CA-IDENTIFIER OF CA-MEDICATION-REQUEST OF
           DFHCOMMAREA TO ZUT0000001C(1)
             MOVE ZUT00000006 TO ZUT0000001C(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000001B
             MOVE LENGTH OF ZUT0000001B TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT0000001C(1)
             MOVE 20 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000001C(2)
             MOVE 20 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-BIOMED-TYPE OF CA-MEDICATION-REQUEST OF DFHCOMMAREA =
           ZUT00000007 THEN
             CONTINUE
           ELSE
             MOVE CA-BIOMED-TYPE OF CA-MEDICATION-REQUEST OF
           DFHCOMMAREA TO ZUT0000001E(1)
             MOVE ZUT00000007 TO ZUT0000001E(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000001D
             MOVE LENGTH OF ZUT0000001D TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT0000001E(1)
             MOVE 2 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000001E(2)
             MOVE 2 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-START-DATE OF CA-MEDICATION-REQUEST OF DFHCOMMAREA =
           ZUT00000008 THEN
             CONTINUE
           ELSE
             MOVE CA-START-DATE OF CA-MEDICATION-REQUEST OF
           DFHCOMMAREA TO ZUT00000020(1)
             MOVE ZUT00000008 TO ZUT00000020(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000001F
             MOVE LENGTH OF ZUT0000001F TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000020(1)
             MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000020(2)
             MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-END-DATE OF CA-MEDICATION-REQUEST OF DFHCOMMAREA =
           ZUT00000009 THEN
             CONTINUE
           ELSE
             MOVE CA-END-DATE OF CA-MEDICATION-REQUEST OF DFHCOMMAREA
           TO ZUT00000022(1)
             MOVE ZUT00000009 TO ZUT00000022(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000021
             MOVE LENGTH OF ZUT00000021 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000022(1)
             MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000022(2)
             MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF (CA-PRESCRIPTION-ID OF CA-MEDICATION-REQUEST OF
           DFHCOMMAREA IS NUMERIC)
               AND (CA-PRESCRIPTION-ID OF CA-MEDICATION-REQUEST OF
           DFHCOMMAREA = 1000891) THEN
             CONTINUE
           ELSE
             MOVE CA-PRESCRIPTION-ID OF CA-MEDICATION-REQUEST OF
           DFHCOMMAREA TO ZUT00000024(1)
             MOVE 1000891 TO ZUT00000024(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000023
             MOVE LENGTH OF ZUT00000023 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000024(1)
             MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000024(2)
             MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-ADDITIONAL-DATA-AZ OF CA-MEDICATION-REQUEST OF
           DFHCOMMAREA = ZUT0000000A THEN
             CONTINUE
           ELSE
             PERFORM VARYING AZ-I FROM 1 BY 1 UNTIL AZ-I > 32317
               MOVE CA-ADDITIONAL-DATA-AZ OF CA-MEDICATION-REQUEST OF
           DFHCOMMAREA(AZ-I:1) TO AZ-CONVERT-HEXIN
               PERFORM CONVERT
               COMPUTE AZ-J = AZ-I * 2 - 1
               MOVE AZ-CONVERT-HEXVAL TO ZUT00000026(1)(AZ-J:2)
             END-PERFORM
             PERFORM VARYING AZ-I FROM 1 BY 1 UNTIL AZ-I > 32317
               MOVE ZUT0000000A(AZ-I:1) TO AZ-CONVERT-HEXIN
               PERFORM CONVERT
               COMPUTE AZ-J = AZ-I * 2 - 1
               MOVE AZ-CONVERT-HEXVAL TO ZUT00000026(2)(AZ-J:2)
             END-PERFORM
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000025
             MOVE LENGTH OF ZUT00000025 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000026(1)
             MOVE 254 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000026(2)
             MOVE 254 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
      * END
           DISPLAY 'TEST_TEST3 SUCCESSFUL.'
           GOBACK.
       INITIALIZE-PARM.
           EXIT.
       CONVERT.
           MOVE AZ-CONVERT-HEXIN TO AZ-DECBYTE
           DIVIDE AZ-DEC BY 16 GIVING AZ-Q REMAINDER AZ-R
           COMPUTE AZ-Q1 = AZ-Q + 1
           COMPUTE AZ-R1 = AZ-R + 1
           MOVE AZ-HEXSTR(AZ-Q1:1) TO AZ-CONVERT-HEXVAL(1:1)
           MOVE AZ-HEXSTR(AZ-R1:1) TO AZ-CONVERT-HEXVAL(2:1)
           EXIT.
       THROW-ASSERTION.
           MOVE 1 TO MESSAGE-LEN OF BZ-ASSERT
           STRING 'COMPARE FAILED IN PROCEDURE DIVISION.'
             DELIMITED BY SIZE INTO MESSAGE-TXT OF BZ-ASSERT
             WITH POINTER MESSAGE-LEN OF BZ-ASSERT
           END-STRING
           SUBTRACT 1 FROM MESSAGE-LEN OF BZ-ASSERT
           SET ADDRESS OF AZ-COMPARE-ITEM-NAME TO
           AZ-COMPARE-ITEM-NAME-PTR.
           SET ADDRESS OF AZ-COMPARE-ITEM-VALUE TO
           AZ-COMPARE-ITEM-VALUE-PTR.
           SET ADDRESS OF AZ-COMPARE-ITEM-EXP-VALUE TO
           AZ-COMPARE-ITEM-EXP-VALUE-PTR.
           DISPLAY '****************************************************
      -    '****************************'
           DISPLAY 'AZU2001W THE TEST "' AZ-TEST(1:AZ-TEST-NAME-LEN) '"
      -    'FAILED DUE TO AN ASSERTION.'
           DISPLAY 'AZU1101I ' MESSAGE-TXT OF BZ-ASSERT(1:MESSAGE-LEN
           OF BZ-ASSERT)
           DISPLAY ' DATA ITEM NAME : '
           AZ-COMPARE-ITEM-NAME(1:AZ-COMPARE-ITEM-NAME-LEN)
           DISPLAY '  VALUE         : '
           AZ-COMPARE-ITEM-VALUE(1:AZ-COMPARE-ITEM-VALUE-LEN)
           DISPLAY '  EXPECTED VALUE: '
           AZ-COMPARE-ITEM-EXP-VALUE(1:AZ-COMPARE-ITEM-EXP-VALUE-LEN)
           DISPLAY '****************************************************
      -    '****************************'
           CALL BZUASSRT USING BZ-P1 BZ-P2 BZ-P3 BZ-ASSERT
           MOVE 1 TO TRACE-LEN OF BZ-TRACE
           STRING 'ITEM NAME='
           AZ-COMPARE-ITEM-NAME(1:AZ-COMPARE-ITEM-NAME-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF BZ-TRACE
               WITH POINTER TRACE-LEN OF BZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF BZ-TRACE
           SET AZ-TRACE-PTR TO ADDRESS OF TRACE-TXT OF BZ-TRACE
      *     CALL 'XCHRFLTR' USING TRACE-LEN OF BZ-TRACE AZ-TRACE-PTR
           CALL BZUTRACE USING BZ-TRACE
           MOVE 1 TO TRACE-LEN OF BZ-TRACE
           STRING 'VALUE='
           AZ-COMPARE-ITEM-VALUE(1:AZ-COMPARE-ITEM-VALUE-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF BZ-TRACE
               WITH POINTER TRACE-LEN OF BZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF BZ-TRACE
      *     CALL 'XCHRFLTR' USING TRACE-LEN OF BZ-TRACE AZ-TRACE-PTR
           CALL BZUTRACE USING BZ-TRACE
           MOVE 1 TO TRACE-LEN OF BZ-TRACE
           STRING 'EXPECTED VALUE='
           AZ-COMPARE-ITEM-EXP-VALUE(1:AZ-COMPARE-ITEM-EXP-VALUE-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF BZ-TRACE
               WITH POINTER TRACE-LEN OF BZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF BZ-TRACE
      *     CALL 'XCHRFLTR' USING TRACE-LEN OF BZ-TRACE AZ-TRACE-PTR
           CALL BZUTRACE USING BZ-TRACE
           EXIT.
       END PROGRAM TEST_TEST3.
      *+---------------------------------------------------------------+
      *| TEST_TEST4                                                    |
      *|     THIS PROGRAM IS FOR TEST TEST4                            |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'TEST_TEST4'.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PROGRAM-NAME   PIC X(8)  VALUE 'HCMADB02'.
       01 BZ-ASSERT.
         03 MESSAGE-LEN PIC S9(4) COMP-4 VALUE 24.
         03 MESSAGE-TXT PIC X(254) VALUE 'HELLO FROM TEST CALLBACK'.
       01  BZ-P1 PIC S9(9) COMP-4 VALUE 4.
       01  BZ-P2 PIC S9(9) COMP-4 VALUE 2001.
       01  BZ-P3 PIC X(3) VALUE 'AZU'.
       01 BZ-TRACE.
         03 TRACE-LEN       PIC S9(4) COMP-4 VALUE 5.
         03 TRACE-TXT       PIC X(254) VALUE 'TRACE'.
       01 BZUASSRT          PIC X(8) VALUE 'BZUASSRT'.
       01 BZUTRACE          PIC X(8) VALUE 'BZUTRACE'.
       01 AZ-TRACE-PTR      POINTER.
       01 ASSERT-ST.
         03 ASSERT-RC PIC 9(9) BINARY VALUE 4.
         03 ASSERT-TEXT PIC 9(4) BINARY VALUE 0.
       01 AZ-TEST-NAME-LEN       PIC S9(9) COMP-5.
       1 AZ-TEST-EXPECTED-DATA-VALUE.
          3 ZUT00000027.
            5 PIC X(6) DISPLAY VALUE '01AMED'.
          3 ZUT00000028.
            5 PIC X(8) DISPLAY VALUE 'CIBALENA'.
            5 PIC X(42) DISPLAY VALUE SPACES.
          3 ZUT00000029.
            5 PIC X(4) DISPLAY VALUE '20MG'.
            5 PIC X(16) DISPLAY VALUE SPACES.
          3 ZUT0000002A.
            5 PIC X(3) VALUE X'4040F0'.
          3 ZUT0000002B.
            5 PIC X(20) DISPLAY VALUE SPACES.
          3 ZUT0000002C.
            5 PIC X(20) DISPLAY VALUE SPACES.
          3 ZUT0000002D.
            5 PIC X(20) DISPLAY VALUE SPACES.
          3 ZUT0000002E.
            5 PIC X(2) DISPLAY VALUE SPACES.
          3 ZUT0000002F.
            5 PIC X(10) DISPLAY VALUE '2021-01-21'.
          3 ZUT00000030.
            5 PIC X(10) DISPLAY VALUE '2021-02-16'.
          3 ZUT00000031.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'4040404040C5D5C44000'.
            5 PIC X(10) VALUE X'000000E4F0F0F0F0F8F4'.
            5 PIC X(10) VALUE X'F50000000000000000E4'.
            5 PIC X(10) VALUE X'F0F0F0F0F8F4F5404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'4040404040404040C5D5'.
            5 PIC X(10) VALUE X'C4400000000000000000'.
            5 PIC X(10) VALUE X'0000000000E4F0F0F0F0'.
            5 PIC X(10) VALUE X'F8F4F540404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'4040404040E4F0F0F0F0'.
            5 PIC X(10) VALUE X'F8F4F5E4F0F0F0F0F8F4'.
            5 PIC X(10) VALUE X'F5C8C1D5C321C2C6C021'.
            5 PIC X(10) VALUE X'C2C6C00000000021C357'.
            5 PIC X(10) VALUE X'D8000000000000214000'.
            5 PIC X(10) VALUE X'00000021C357D8000021'.
            5 PIC X(10) VALUE X'20D4C2D3D20000211800'.
            5 PIC X(10) VALUE X'050102FFFFFFFFA285EB'.
            5 PIC X(10) VALUE X'52404040404040404021'.
            5 PIC X(10) VALUE X'C3791040404040404040'.
            5 PIC X(10) VALUE X'40000040404040404000'.
            5 PIC X(10) VALUE X'00404040404040C9C7E9'.
            5 PIC X(10) VALUE X'E2D9E3C3C40000000040'.
            5 PIC X(10) VALUE X'40404000000000404040'.
            5 PIC X(10) VALUE X'400000000040404040E2'.
            5 PIC X(10) VALUE X'E8E2D6E4E34040000000'.
            5 PIC X(10) VALUE X'00404040400E40404040'.
            5 PIC X(10) VALUE X'4040400F404040404040'.
            5 PIC X(10) VALUE X'40000000004040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40000000004040404040'.
            5 PIC X(10) VALUE X'40404040404040004044'.
            5 PIC X(10) VALUE X'00001EC8C3C9D7C4C2F0'.
            5 PIC X(10) VALUE X'F11B08112F04CFB7F000'.
            5 PIC X(10) VALUE X'0121C3788821C35AB821'.
            5 PIC X(10) VALUE X'C358F0047400E7000000'.
            5 PIC X(10) VALUE X'F4000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00E2D8D3C4C14E400800'.
            5 PIC X(10) VALUE X'0001C8000A000A01C400'.
            5 PIC X(10) VALUE X'0A21C1697C0000000000'.
            5 PIC X(10) VALUE X'08000004740000000040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'4001C4001421C1698600'.
            5 PIC X(10) VALUE X'00000000080000047400'.
            5 PIC X(10) VALUE X'00000040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'404040404001C4000A21'.
            5 PIC X(10) VALUE X'C1699A00000000000800'.
            5 PIC X(10) VALUE X'00047400000000404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404001'.
            5 PIC X(10) VALUE X'C4000A21C16972000000'.
            5 PIC X(10) VALUE X'00000800000474000000'.
            5 PIC X(10) VALUE X'00404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404001C4001421C169'.
            5 PIC X(10) VALUE X'A4000000000008000004'.
            5 PIC X(10) VALUE X'74000000004040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'4040404040404001C400'.
            5 PIC X(10) VALUE X'1421C169B80000000000'.
            5 PIC X(10) VALUE X'08000004740000000040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'4001C4000A21C169CC00'.
            5 PIC X(10) VALUE X'00000000080000047400'.
            5 PIC X(10) VALUE X'00000040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'404040404001C4001421'.
            5 PIC X(10) VALUE X'C169D600000000000800'.
            5 PIC X(10) VALUE X'00047400000000404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404001'.
            5 PIC X(10) VALUE X'C4003221C169EA000000'.
            5 PIC X(10) VALUE X'00000800000474000000'.
            5 PIC X(10) VALUE X'00404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404001C4000A21C16A'.
            5 PIC X(10) VALUE X'1C000000000008000004'.
            5 PIC X(10) VALUE X'74000000004040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040E2D8D3'.
            5 PIC X(10) VALUE X'C4C14040080000003C00'.
            5 PIC X(10) VALUE X'01000101F0000421C378'.
            5 PIC X(10) VALUE X'80000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040400000000140'.
            5 PIC X(10) VALUE X'40404000004040404040'.
            5 PIC X(10) VALUE X'40000000024040404000'.
            5 PIC X(10) VALUE X'00000840404040000000'.
            5 PIC X(10) VALUE X'10404040400000002040'.
            5 PIC X(10) VALUE X'404040938440A3818293'.
            5 PIC X(10) VALUE X'85408486888589A38182'.
            5 PIC X(10) VALUE X'40F7F1F04B4040000000'.
            5 PIC X(10) VALUE X'0C404040400000404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040400000404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'404040404040404040C8'.
            5 PIC X(10) VALUE X'C3D4C1C3D7F0F2F0F0F0'.
            5 PIC X(10) VALUE X'F0F8F4F54021C1696009'.
            5 PIC X(10) VALUE X'C4C8C3C1E9C5D9D9E200'.
            5 PIC X(10) VALUE X'00000040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040C8C3D7'.
            5 PIC X(10) VALUE X'F1C2C9F0F140D7D5E4D4'.
            5 PIC X(10) VALUE X'7EF0F0F0F0F0F0F0F0F0'.
            5 PIC X(10) VALUE X'F240D4D5E4D47E404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040E2D8D3C3D6C4'.
            5 PIC X(10) VALUE X'C57E40404040404040C3'.
            5 PIC X(10) VALUE X'D6D4D4C1D9C5C17E4040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'4040400012F0F0F1C840'.
            5 PIC X(10) VALUE X'400000000240404040E2'.
            5 PIC X(10) VALUE X'D8D3C3C1404040000000'.
            5 PIC X(10) VALUE X'88000000000000404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040C4E2D5'.
            5 PIC X(10) VALUE X'40404040400000000000'.
            5 PIC X(10) VALUE X'00000000000000FFFFFF'.
            5 PIC X(10) VALUE X'FF0000000000000000E6'.
            5 PIC X(10) VALUE X'E6404040404040404040'.
            5 PIC X(10) VALUE X'F0F1F0F0F4C5D5C460D4'.
            5 PIC X(10) VALUE X'C2D3D2E4F0F0F0F0F8F4'.
            5 PIC X(10) VALUE X'F5E4F0F0F0F0F8F4F500'.
            5 PIC X(10) VALUE X'007F8CC3C9C3E2000000'.
            5 PIC X(10) VALUE X'12C9D5D7E30101C8C3C9'.
            5 PIC X(10) VALUE X'D7C4C2F0F1000000EFC5'.
            5 PIC X(10) VALUE X'C9C24000000055015131'.
            5 PIC X(10) VALUE X'6C0120349FC8C3D4C100'.
            5 PIC X(10) VALUE X'00845CC3D7F0F2000001'.
            5 PIC X(10) VALUE X'587EF47D0E0800000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000004040'.
            5 PIC X(10) VALUE X'40404040404000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'00000000000000000000'.
            5 PIC X(10) VALUE X'0000C100000000000009'.
            5 PIC X(10) VALUE X'0E0800000700001000C3'.
            5 PIC X(10) VALUE X'D4C14000007EF4F0F1C9'.
            5 PIC X(10) VALUE X'D7C1E3F0F0F0F0F0F0F0'.
            5 PIC X(10) VALUE X'F0F0F0F0F2F1F1F2F7F8'.
            5 PIC X(10) VALUE X'F1F1F2F3F4D196889540'.
            5 PIC X(10) VALUE X'4040404040E29489A388'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'4040404040F1F9F6F560'.
            5 PIC X(10) VALUE X'F0F960F3F0F240E29489'.
            5 PIC X(10) VALUE X'A38840E2A3998585A340'.
            5 PIC X(10) VALUE X'4040404040D585A640E8'.
            5 PIC X(10) VALUE X'96999240404040404040'.
            5 PIC X(10) VALUE X'4040404040F1F2F3F4F5'.
            5 PIC X(10) VALUE X'4040404040F0F0F160F9'.
            5 PIC X(10) VALUE X'F1F160F9F1F1F3404040'.
            5 PIC X(10) VALUE X'4040404040D1968895E2'.
            5 PIC X(10) VALUE X'9489A3887C8594818993'.
            5 PIC X(10) VALUE X'4B839694404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'40404040404040404040'.
            5 PIC X(10) VALUE X'404040404091968895A2'.
            5 PIC X(10) VALUE SPACES.
       01 AZ-COMPARE.
         03 AZ-COMPARE-ITEM-NAME-PTR  POINTER.
         03 AZ-COMPARE-ITEM-NAME-LEN  PIC S9(9) COMP-5.
         03 AZ-COMPARE-ITEM-VALUE-PTR POINTER.
         03 AZ-COMPARE-ITEM-VALUE-LEN PIC S9(9) COMP-5.
         03 AZ-COMPARE-ITEM-EXP-VALUE-PTR POINTER.
         03 AZ-COMPARE-ITEM-EXP-VALUE-LEN PIC S9(9) COMP-5.
       LOCAL-STORAGE SECTION.
       1 AZ-COMPARE-ITEM-NAMES.
         3 ZUT00000032.
            5 PIC X(20) DISPLAY VALUE 'CA-REQUEST-ID OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT00000034.
            5 PIC X(20) DISPLAY VALUE 'CA-RETURN-CODE OF DF'.
            5 PIC X(9) DISPLAY VALUE 'HCOMMAREA'.
         3 ZUT00000036.
            5 PIC X(20) DISPLAY VALUE 'CA-PATIENT-ID OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT00000038.
            5 PIC X(20) DISPLAY VALUE 'CA-DRUG-NAME OF CA-M'.
            5 PIC X(20) DISPLAY VALUE 'EDICATION-REQUEST OF'.
            5 PIC X(12) DISPLAY VALUE ' DFHCOMMAREA'.
         3 ZUT0000003A.
            5 PIC X(20) DISPLAY VALUE 'CA-STRENGTH OF CA-ME'.
            5 PIC X(20) DISPLAY VALUE 'DICATION-REQUEST OF '.
            5 PIC X(11) DISPLAY VALUE 'DFHCOMMAREA'.
         3 ZUT0000003C.
            5 PIC X(20) DISPLAY VALUE 'CA-AMOUNT OF CA-MEDI'.
            5 PIC X(20) DISPLAY VALUE 'CATION-REQUEST OF DF'.
            5 PIC X(9) DISPLAY VALUE 'HCOMMAREA'.
         3 ZUT0000003E.
            5 PIC X(20) DISPLAY VALUE 'CA-ROUTE OF CA-MEDIC'.
            5 PIC X(20) DISPLAY VALUE 'ATION-REQUEST OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT00000040.
            5 PIC X(20) DISPLAY VALUE 'CA-FREQUENCY OF CA-M'.
            5 PIC X(20) DISPLAY VALUE 'EDICATION-REQUEST OF'.
            5 PIC X(12) DISPLAY VALUE ' DFHCOMMAREA'.
         3 ZUT00000042.
            5 PIC X(20) DISPLAY VALUE 'CA-IDENTIFIER OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'MEDICATION-REQUEST O'.
            5 PIC X(13) DISPLAY VALUE 'F DFHCOMMAREA'.
         3 ZUT00000044.
            5 PIC X(20) DISPLAY VALUE 'CA-BIOMED-TYPE OF CA'.
            5 PIC X(20) DISPLAY VALUE '-MEDICATION-REQUEST '.
            5 PIC X(14) DISPLAY VALUE 'OF DFHCOMMAREA'.
         3 ZUT00000046.
            5 PIC X(20) DISPLAY VALUE 'CA-START-DATE OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'MEDICATION-REQUEST O'.
            5 PIC X(13) DISPLAY VALUE 'F DFHCOMMAREA'.
         3 ZUT00000048.
            5 PIC X(20) DISPLAY VALUE 'CA-END-DATE OF CA-ME'.
            5 PIC X(20) DISPLAY VALUE 'DICATION-REQUEST OF '.
            5 PIC X(11) DISPLAY VALUE 'DFHCOMMAREA'.
         3 ZUT0000004A.
            5 PIC X(20) DISPLAY VALUE 'CA-PRESCRIPTION-ID O'.
            5 PIC X(20) DISPLAY VALUE 'F CA-MEDICATION-REQU'.
            5 PIC X(18) DISPLAY VALUE 'EST OF DFHCOMMAREA'.
         3 ZUT0000004C.
            5 PIC X(20) DISPLAY VALUE 'CA-ADDITIONAL-DATA O'.
            5 PIC X(20) DISPLAY VALUE 'F CA-MEDICATION-REQU'.
            5 PIC X(18) DISPLAY VALUE 'EST OF DFHCOMMAREA'.
       1 AZ-COMPARE-WORK-ITEMS.
          3 ZUT00000033 PIC X(6) OCCURS 2.
          3 ZUT00000035 PIC 9(2) OCCURS 2.
          3 ZUT00000037 PIC 9(10) OCCURS 2.
          3 ZUT00000039 PIC X(50) OCCURS 2.
          3 ZUT0000003B PIC X(20) OCCURS 2.
          3 ZUT0000003D PIC X(6) OCCURS 2.
          3 ZUT0000003F PIC X(20) OCCURS 2.
          3 ZUT00000041 PIC X(20) OCCURS 2.
          3 ZUT00000043 PIC X(20) OCCURS 2.
          3 ZUT00000045 PIC X(2) OCCURS 2.
          3 ZUT00000047 PIC X(10) OCCURS 2.
          3 ZUT00000049 PIC X(10) OCCURS 2.
          3 ZUT0000004B PIC 9(10) OCCURS 2.
          3 ZUT0000004D PIC X(64634) OCCURS 2.
       01 AZ-CONVERT.
         03 AZ-CONVERT-HEXIN  PIC X(1).
         03 AZ-CONVERT-HEXVAL PIC X(2).
         03 AZ-HEXSTR PIC X(16) VALUE "0123456789ABCDEF".
         03 AZ-DEC  PIC S9(4) COMP VALUE 0.
         03 FILLER REDEFINES AZ-DEC.
           05 FILLER PIC X.
           05 AZ-DECBYTE PIC X.
         03 AZ-I PIC S9(8) COMP.
         03 AZ-J PIC S9(8) COMP.
         03 AZ-Q PIC S9(8) COMP.
         03 AZ-R PIC S9(8) COMP.
         03 AZ-Q1 PIC S9(8) COMP.
         03 AZ-R1 PIC S9(8) COMP.
       LINKAGE SECTION.
       01 AZ-TEST                   PIC X(80).
       01 AZ-ARG-LIST.
         03 ARG-LENGTH PIC 9(4) COMP-4.
         03 ARG-DATA PIC X(256).
       01 AZ-COMPARE-ITEM-NAME      PIC X(254).
       01 AZ-COMPARE-ITEM-VALUE     PIC X(254).
       01 AZ-COMPARE-ITEM-EXP-VALUE PIC X(254).
       1 DFHEIBLK.
         2 EIBTIME PICTURE S9(7) USAGE COMPUTATIONAL-3.
         2 EIBDATE PICTURE S9(7) USAGE COMPUTATIONAL-3.
         2 EIBTRNID PICTURE X(4).
         2 EIBTASKN PICTURE S9(7) USAGE COMPUTATIONAL-3.
         2 EIBTRMID PICTURE X(4).
         2 DFHEIGDI PICTURE S9(4) USAGE COMPUTATIONAL-5.
         2 EIBCPOSN PICTURE S9(4) USAGE COMPUTATIONAL-5.
         2 EIBCALEN PICTURE S9(4) USAGE COMPUTATIONAL-5.
         2 EIBAID PICTURE X(1).
         2 EIBFN PICTURE X(2).
         2 EIBRCODE PICTURE X(6).
         2 EIBDS PICTURE X(8).
         2 EIBREQID PICTURE X(8).
         2 EIBRSRCE PICTURE X(8).
         2 EIBSYNC PICTURE X.
         2 EIBFREE PICTURE X.
         2 EIBRECV PICTURE X.
         2 EIBSEND PICTURE X.
         2 EIBATT PICTURE X.
         2 EIBEOC PICTURE X.
         2 EIBFMH PICTURE X.
         2 EIBCOMPL PICTURE X(1).
         2 EIBSIG PICTURE X(1).
         2 EIBCONF PICTURE X(1).
         2 EIBERR PICTURE X(1).
         2 EIBERRCD PICTURE X(4).
         2 EIBSYNRB PICTURE X.
         2 EIBNODAT PICTURE X.
         2 EIBRESP PICTURE S9(8) USAGE COMPUTATIONAL.
         2 EIBRESP2 PICTURE S9(8) USAGE COMPUTATIONAL.
         2 EIBRLDBK PICTURE X(1).
       1 DFHCOMMAREA.
         3 CA-REQUEST-ID PIC X(6).
         3 CA-RETURN-CODE PIC 9(2).
         3 CA-PATIENT-ID PIC 9(10).
         3 CA-REQUEST-SPECIFIC PIC X(32482).
         3 CA-PATIENT-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-INS-CARD-NUM PIC X(10).
         5 CA-FIRST-NAME PIC X(10).
         5 CA-LAST-NAME PIC X(20).
         5 CA-DOB PIC X(10).
         5 CA-ADDRESS PIC X(20).
         5 CA-CITY PIC X(20).
         5 CA-POSTCODE PIC X(10).
         5 CA-PHONE-MOBILE PIC X(20).
         5 CA-EMAIL-ADDRESS PIC X(50).
         5 CA-USERID PIC X(10).
         5 CA-ADDITIONAL-DATA PIC X(32302).
         3 CA-PATIENT-USER-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-USERNAME PIC X(10).
         5 CA-USERPASSWORD PIC X(14).
         5 CA-ADDITIONAL-DATA PIC X(32458).
         3 CA-MEDICATION-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-DRUG-NAME PIC X(50).
         5 CA-STRENGTH PIC X(20).
         5 CA-AMOUNT PIC 9(03).
          5 CA-AMOUNT-AZ REDEFINES CA-AMOUNT.
          6 PIC X(3) DISPLAY.
         5 CA-ROUTE PIC X(20).
         5 CA-FREQUENCY PIC X(20).
         5 CA-IDENTIFIER PIC X(20).
         5 CA-BIOMED-TYPE PIC X(2).
         5 CA-START-DATE PIC X(10).
         5 CA-END-DATE PIC X(10).
         5 CA-PRESCRIPTION-ID PIC 9(10).
         5 CA-ADDITIONAL-DATA PIC X(32317).
          5 CA-ADDITIONAL-DATA-AZ REDEFINES CA-ADDITIONAL-DATA.
          6 PIC X(32317) DISPLAY.
         3 CA-MEDITATION-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-MEDITATION-NAME PIC X(50).
         5 CA-MEDITATION-TYPE PIC X(20).
         5 CA-RELIEF PIC X(20).
         5 CA-POSTURE PIC X(20).
         5 CA-HOW-OFTEN PIC X(20).
         5 CA-ADDITIONAL-DATA PIC X(32352).
         3 CA-THRESHOLD-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-HR-THRESHOLD PIC X(10).
         5 CA-BP-THRESHOLD PIC X(10).
         5 CA-MS-THRESHOLD PIC X(10).
         5 CA-ADDITIONAL-DATA PIC X(32452).
         3 CA-VISIT-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-VISIT-DATE PIC X(10).
         5 CA-VISIT-TIME PIC X(10).
         5 CA-HEART-RATE PIC X(10).
         5 CA-BLOOD-PRESSURE PIC X(10).
         5 CA-MENTAL-STATE PIC X(10).
         5 CA-ADDITIONAL-DATA PIC X(32432).
       PROCEDURE DIVISION USING AZ-TEST
           DFHEIBLK DFHCOMMAREA.
      * START
           DISPLAY 'TEST_TEST4 STARTED...'
           MOVE 0 TO AZ-TEST-NAME-LEN.
           INSPECT AZ-TEST TALLYING AZ-TEST-NAME-LEN FOR
           CHARACTERS BEFORE INITIAL SPACE.
      * INITIALIZE PARAMETER
           PERFORM INITIALIZE-PARM
      * SET AREA ADDRESS TO POINTER
      * SET INPUT VALUE
           MOVE 0 TO RETURN-CODE.
      * CALL TEST PROGRAM
           DISPLAY 'CALL HCMADB02'
           CALL PROGRAM-NAME
           USING DFHEIBLK DFHCOMMAREA
           .
      * EVALUATE OUTPUT VALUE
           MOVE 0 TO RETURN-CODE
           IF CA-REQUEST-ID OF DFHCOMMAREA = ZUT00000027 THEN
             CONTINUE
           ELSE
             MOVE CA-REQUEST-ID OF DFHCOMMAREA TO ZUT00000033(1)
             MOVE ZUT00000027 TO ZUT00000033(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000032
             MOVE LENGTH OF ZUT00000032 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000033(1)
             MOVE 6 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000033(2)
             MOVE 6 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF (CA-RETURN-CODE OF DFHCOMMAREA IS NUMERIC)
               AND (CA-RETURN-CODE OF DFHCOMMAREA = 0) THEN
             CONTINUE
           ELSE
             MOVE CA-RETURN-CODE OF DFHCOMMAREA TO ZUT00000035(1)
             MOVE 0 TO ZUT00000035(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000034
             MOVE LENGTH OF ZUT00000034 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000035(1)
             MOVE 2 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000035(2)
             MOVE 2 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF (CA-PATIENT-ID OF DFHCOMMAREA IS NUMERIC)
               AND (CA-PATIENT-ID OF DFHCOMMAREA = 2) THEN
             CONTINUE
           ELSE
             MOVE CA-PATIENT-ID OF DFHCOMMAREA TO ZUT00000037(1)
             MOVE 2 TO ZUT00000037(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000036
             MOVE LENGTH OF ZUT00000036 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000037(1)
             MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000037(2)
             MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-DRUG-NAME OF CA-MEDICATION-REQUEST OF DFHCOMMAREA =
           ZUT00000028 THEN
             CONTINUE
           ELSE
             MOVE CA-DRUG-NAME OF CA-MEDICATION-REQUEST OF DFHCOMMAREA
           TO ZUT00000039(1)
             MOVE ZUT00000028 TO ZUT00000039(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000038
             MOVE LENGTH OF ZUT00000038 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000039(1)
             MOVE 50 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000039(2)
             MOVE 50 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-STRENGTH OF CA-MEDICATION-REQUEST OF DFHCOMMAREA =
           ZUT00000029 THEN
             CONTINUE
           ELSE
             MOVE CA-STRENGTH OF CA-MEDICATION-REQUEST OF DFHCOMMAREA
           TO ZUT0000003B(1)
             MOVE ZUT00000029 TO ZUT0000003B(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000003A
             MOVE LENGTH OF ZUT0000003A TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT0000003B(1)
             MOVE 20 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000003B(2)
             MOVE 20 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-AMOUNT-AZ OF CA-MEDICATION-REQUEST OF DFHCOMMAREA =
           ZUT0000002A THEN
             CONTINUE
           ELSE
             PERFORM VARYING AZ-I FROM 1 BY 1 UNTIL AZ-I > 3
               MOVE CA-AMOUNT-AZ OF CA-MEDICATION-REQUEST OF
           DFHCOMMAREA(AZ-I:1) TO AZ-CONVERT-HEXIN
               PERFORM CONVERT
               COMPUTE AZ-J = AZ-I * 2 - 1
               MOVE AZ-CONVERT-HEXVAL TO ZUT0000003D(1)(AZ-J:2)
             END-PERFORM
             PERFORM VARYING AZ-I FROM 1 BY 1 UNTIL AZ-I > 3
               MOVE ZUT0000002A(AZ-I:1) TO AZ-CONVERT-HEXIN
               PERFORM CONVERT
               COMPUTE AZ-J = AZ-I * 2 - 1
               MOVE AZ-CONVERT-HEXVAL TO ZUT0000003D(2)(AZ-J:2)
             END-PERFORM
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000003C
             MOVE LENGTH OF ZUT0000003C TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT0000003D(1)
             MOVE 6 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000003D(2)
             MOVE 6 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-ROUTE OF CA-MEDICATION-REQUEST OF DFHCOMMAREA =
           ZUT0000002B THEN
             CONTINUE
           ELSE
             MOVE CA-ROUTE OF CA-MEDICATION-REQUEST OF DFHCOMMAREA TO
           ZUT0000003F(1)
             MOVE ZUT0000002B TO ZUT0000003F(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000003E
             MOVE LENGTH OF ZUT0000003E TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT0000003F(1)
             MOVE 20 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000003F(2)
             MOVE 20 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-FREQUENCY OF CA-MEDICATION-REQUEST OF DFHCOMMAREA =
           ZUT0000002C THEN
             CONTINUE
           ELSE
             MOVE CA-FREQUENCY OF CA-MEDICATION-REQUEST OF DFHCOMMAREA
           TO ZUT00000041(1)
             MOVE ZUT0000002C TO ZUT00000041(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000040
             MOVE LENGTH OF ZUT00000040 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000041(1)
             MOVE 20 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000041(2)
             MOVE 20 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-IDENTIFIER OF CA-MEDICATION-REQUEST OF DFHCOMMAREA =
           ZUT0000002D THEN
             CONTINUE
           ELSE
             MOVE CA-IDENTIFIER OF CA-MEDICATION-REQUEST OF
           DFHCOMMAREA TO ZUT00000043(1)
             MOVE ZUT0000002D TO ZUT00000043(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000042
             MOVE LENGTH OF ZUT00000042 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000043(1)
             MOVE 20 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000043(2)
             MOVE 20 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-BIOMED-TYPE OF CA-MEDICATION-REQUEST OF DFHCOMMAREA =
           ZUT0000002E THEN
             CONTINUE
           ELSE
             MOVE CA-BIOMED-TYPE OF CA-MEDICATION-REQUEST OF
           DFHCOMMAREA TO ZUT00000045(1)
             MOVE ZUT0000002E TO ZUT00000045(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000044
             MOVE LENGTH OF ZUT00000044 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000045(1)
             MOVE 2 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000045(2)
             MOVE 2 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-START-DATE OF CA-MEDICATION-REQUEST OF DFHCOMMAREA =
           ZUT0000002F THEN
             CONTINUE
           ELSE
             MOVE CA-START-DATE OF CA-MEDICATION-REQUEST OF
           DFHCOMMAREA TO ZUT00000047(1)
             MOVE ZUT0000002F TO ZUT00000047(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000046
             MOVE LENGTH OF ZUT00000046 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000047(1)
             MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000047(2)
             MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-END-DATE OF CA-MEDICATION-REQUEST OF DFHCOMMAREA =
           ZUT00000030 THEN
             CONTINUE
           ELSE
             MOVE CA-END-DATE OF CA-MEDICATION-REQUEST OF DFHCOMMAREA
           TO ZUT00000049(1)
             MOVE ZUT00000030 TO ZUT00000049(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000048
             MOVE LENGTH OF ZUT00000048 TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT00000049(1)
             MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000049(2)
             MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF (CA-PRESCRIPTION-ID OF CA-MEDICATION-REQUEST OF
           DFHCOMMAREA IS NUMERIC)
               AND (CA-PRESCRIPTION-ID OF CA-MEDICATION-REQUEST OF
           DFHCOMMAREA = 1000892) THEN
             CONTINUE
           ELSE
             MOVE CA-PRESCRIPTION-ID OF CA-MEDICATION-REQUEST OF
           DFHCOMMAREA TO ZUT0000004B(1)
             MOVE 1000892 TO ZUT0000004B(2)
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000004A
             MOVE LENGTH OF ZUT0000004A TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT0000004B(1)
             MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000004B(2)
             MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
           IF CA-ADDITIONAL-DATA-AZ OF CA-MEDICATION-REQUEST OF
           DFHCOMMAREA = ZUT00000031 THEN
             CONTINUE
           ELSE
             PERFORM VARYING AZ-I FROM 1 BY 1 UNTIL AZ-I > 32317
               MOVE CA-ADDITIONAL-DATA-AZ OF CA-MEDICATION-REQUEST OF
           DFHCOMMAREA(AZ-I:1) TO AZ-CONVERT-HEXIN
               PERFORM CONVERT
               COMPUTE AZ-J = AZ-I * 2 - 1
               MOVE AZ-CONVERT-HEXVAL TO ZUT0000004D(1)(AZ-J:2)
             END-PERFORM
             PERFORM VARYING AZ-I FROM 1 BY 1 UNTIL AZ-I > 32317
               MOVE ZUT00000031(AZ-I:1) TO AZ-CONVERT-HEXIN
               PERFORM CONVERT
               COMPUTE AZ-J = AZ-I * 2 - 1
               MOVE AZ-CONVERT-HEXVAL TO ZUT0000004D(2)(AZ-J:2)
             END-PERFORM
             SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000004C
             MOVE LENGTH OF ZUT0000004C TO AZ-COMPARE-ITEM-NAME-LEN
             SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF ZUT0000004D(1)
             MOVE 254 TO AZ-COMPARE-ITEM-VALUE-LEN
             SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000004D(2)
             MOVE 254 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
             PERFORM THROW-ASSERTION
           END-IF
      * END
           DISPLAY 'TEST_TEST4 SUCCESSFUL.'
           GOBACK.
       INITIALIZE-PARM.
           EXIT.
       CONVERT.
           MOVE AZ-CONVERT-HEXIN TO AZ-DECBYTE
           DIVIDE AZ-DEC BY 16 GIVING AZ-Q REMAINDER AZ-R
           COMPUTE AZ-Q1 = AZ-Q + 1
           COMPUTE AZ-R1 = AZ-R + 1
           MOVE AZ-HEXSTR(AZ-Q1:1) TO AZ-CONVERT-HEXVAL(1:1)
           MOVE AZ-HEXSTR(AZ-R1:1) TO AZ-CONVERT-HEXVAL(2:1)
           EXIT.
       THROW-ASSERTION.
           MOVE 1 TO MESSAGE-LEN OF BZ-ASSERT
           STRING 'COMPARE FAILED IN PROCEDURE DIVISION.'
             DELIMITED BY SIZE INTO MESSAGE-TXT OF BZ-ASSERT
             WITH POINTER MESSAGE-LEN OF BZ-ASSERT
           END-STRING
           SUBTRACT 1 FROM MESSAGE-LEN OF BZ-ASSERT
           SET ADDRESS OF AZ-COMPARE-ITEM-NAME TO
           AZ-COMPARE-ITEM-NAME-PTR.
           SET ADDRESS OF AZ-COMPARE-ITEM-VALUE TO
           AZ-COMPARE-ITEM-VALUE-PTR.
           SET ADDRESS OF AZ-COMPARE-ITEM-EXP-VALUE TO
           AZ-COMPARE-ITEM-EXP-VALUE-PTR.
           DISPLAY '****************************************************
      -    '****************************'
           DISPLAY 'AZU2001W THE TEST "' AZ-TEST(1:AZ-TEST-NAME-LEN) '"
      -    'FAILED DUE TO AN ASSERTION.'
           DISPLAY 'AZU1101I ' MESSAGE-TXT OF BZ-ASSERT(1:MESSAGE-LEN
           OF BZ-ASSERT)
           DISPLAY ' DATA ITEM NAME : '
           AZ-COMPARE-ITEM-NAME(1:AZ-COMPARE-ITEM-NAME-LEN)
           DISPLAY '  VALUE         : '
           AZ-COMPARE-ITEM-VALUE(1:AZ-COMPARE-ITEM-VALUE-LEN)
           DISPLAY '  EXPECTED VALUE: '
           AZ-COMPARE-ITEM-EXP-VALUE(1:AZ-COMPARE-ITEM-EXP-VALUE-LEN)
           DISPLAY '****************************************************
      -    '****************************'
           CALL BZUASSRT USING BZ-P1 BZ-P2 BZ-P3 BZ-ASSERT
           MOVE 1 TO TRACE-LEN OF BZ-TRACE
           STRING 'ITEM NAME='
           AZ-COMPARE-ITEM-NAME(1:AZ-COMPARE-ITEM-NAME-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF BZ-TRACE
               WITH POINTER TRACE-LEN OF BZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF BZ-TRACE
           SET AZ-TRACE-PTR TO ADDRESS OF TRACE-TXT OF BZ-TRACE
      *     CALL 'XCHRFLTR' USING TRACE-LEN OF BZ-TRACE AZ-TRACE-PTR
           CALL BZUTRACE USING BZ-TRACE
           MOVE 1 TO TRACE-LEN OF BZ-TRACE
           STRING 'VALUE='
           AZ-COMPARE-ITEM-VALUE(1:AZ-COMPARE-ITEM-VALUE-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF BZ-TRACE
               WITH POINTER TRACE-LEN OF BZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF BZ-TRACE
      *     CALL 'XCHRFLTR' USING TRACE-LEN OF BZ-TRACE AZ-TRACE-PTR
           CALL BZUTRACE USING BZ-TRACE
           MOVE 1 TO TRACE-LEN OF BZ-TRACE
           STRING 'EXPECTED VALUE='
           AZ-COMPARE-ITEM-EXP-VALUE(1:AZ-COMPARE-ITEM-EXP-VALUE-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF BZ-TRACE
               WITH POINTER TRACE-LEN OF BZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF BZ-TRACE
      *     CALL 'XCHRFLTR' USING TRACE-LEN OF BZ-TRACE AZ-TRACE-PTR
           CALL BZUTRACE USING BZ-TRACE
           EXIT.
       END PROGRAM TEST_TEST4.
      *+---------------------------------------------------------------+
      *| BZU_INIT                                                      |
      *|     INITIAL PROCEDURE                                         |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'BZU_INIT'.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 AZ-TEST-NAME-LEN      PIC S9(9) COMP-5.
       01 AZ-TESTCASE-ID        PIC X(36)
           VALUE '28c366c3-5fb9-4750-a7a0-3e1d79855d73'.
       LINKAGE SECTION.
       01 AZ-TEST               PIC X(80).
       01 AZ-TEST-ID            PIC X(80).
       PROCEDURE DIVISION USING AZ-TEST AZ-TEST-ID.
           MOVE 0 TO AZ-TEST-NAME-LEN.
           INSPECT AZ-TEST TALLYING AZ-TEST-NAME-LEN FOR
           CHARACTERS BEFORE INITIAL SPACE.
           DISPLAY 'BZU_INIT : ' AZ-TEST(1:AZ-TEST-NAME-LEN)
           MOVE AZ-TESTCASE-ID TO AZ-TEST-ID
           GOBACK.
       END PROGRAM BZU_INIT.
      *+---------------------------------------------------------------+
      *| BZU_TERM                                                      |
      *|     TERMINATION PROCEDURE                                     |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'BZU_TERM'.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 AZ-TEST-NAME-LEN      PIC S9(9) COMP-5.
       LINKAGE SECTION.
       01 AZ-TEST               PIC X(80).
       PROCEDURE DIVISION USING AZ-TEST.
           MOVE 0 TO AZ-TEST-NAME-LEN.
           INSPECT AZ-TEST TALLYING AZ-TEST-NAME-LEN FOR
           CHARACTERS BEFORE INITIAL SPACE.
           DISPLAY 'BZU_TERM : ' AZ-TEST(1:AZ-TEST-NAME-LEN)
           GOBACK.
       END PROGRAM BZU_TERM.
      *+---------------------------------------------------------------+
      *| XCHRFLTR                                                      |
      *|     XML CHARACTER FILTER                                      |
      *|     REPLACE ILLEGAL XML CHARACTER WITH SPACE                  |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'XCHRFLTR'.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       1 X00000030.
       2 PIC X(24) USAGE DISPLAY
           VALUE X'0001020304060708090A0B0C0E0F1011121314161718191A'.
       2 PIC X(24) USAGE DISPLAY
           VALUE X'1B1C1D1E1F2021222324262728292A2B2C2D2E2F30313233'.
       2 PIC X(13) USAGE DISPLAY
           VALUE X'3435363738393A3B3C3D3E3FFF'.
       1 ILLEGAL-XML-CHARS REDEFINES X00000030
           PIC X(61).
       01 E-QUOT PIC X(6) VALUE '&quot;'.
       LOCAL-STORAGE SECTION.
       1 W-TXT       PIC X(254) VALUE SPACES.
       1 W-N         PIC 9(3) BINARY VALUE 0.
       1 W-IN-I      PIC 9(3) BINARY VALUE 0.
       1 W-OUT-I     PIC 9(3) BINARY VALUE 1.
       LINKAGE SECTION.
       1 CONTENT-LEN PIC S9(4) COMP-4.
       1 CONTENT-PTR POINTER.
       1 CONTENT-TXT PIC X(254).
       PROCEDURE DIVISION USING CONTENT-LEN CONTENT-PTR.
       MAINLINE SECTION.
           SET ADDRESS OF CONTENT-TXT TO CONTENT-PTR
           INSPECT CONTENT-TXT(1:CONTENT-LEN) CONVERTING
            ILLEGAL-XML-CHARS TO SPACES
           PERFORM VARYING W-IN-I FROM 1 BY 1
             UNTIL W-IN-I > CONTENT-LEN
             EVALUATE CONTENT-TXT(W-IN-I:1)
             WHEN '"'
               MOVE LENGTH OF E-QUOT TO W-N
               MOVE E-QUOT TO W-TXT(W-OUT-I:W-N)
             WHEN OTHER
               MOVE 1 TO W-N
               MOVE CONTENT-TXT(W-IN-I:1) TO W-TXT(W-OUT-I:1)
             END-EVALUATE
             ADD W-N TO W-OUT-I
           END-PERFORM
           MOVE W-TXT(1:W-OUT-I) TO CONTENT-TXT(1:W-OUT-I)
           SUBTRACT 1 FROM W-OUT-I
           MOVE W-OUT-I TO CONTENT-LEN
           GOBACK.
       END PROGRAM 'XCHRFLTR'.
      *+---------------------------------------------------------------+
      *| EVALOPT                                                       |
      *|   FUNCTION TO EVALUATE THAT THE BIT OF OPTION DATA            |
      *|   (1) TAKE AND OF GROUP COMMON MASK AND OPTION IN ARG0        |
      *|   (2) CHECK IF THE GROUP MASK IS EQUAL TO (1)                 |
      *|       IF EQUAL,    RTN01 IS 0                                 |
      *|       IF NO EQUAL, RTN01 IS 1                                 |
      *+---------------------------------------------------------------+
       ID DIVISION.
       PROGRAM-ID. EVALOPT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  OUT1-REC.
         05 OUT1-DATA                PIC X(1) OCCURS 8.
       01 OUT1-DATA-R REDEFINES OUT1-REC.
         05 OUT1-DATA-UP             PIC X(4).
         05 OUT1-DATA-DOWN           PIC X(4).
       01  OUT2-REC.
         05  OUT2-DATA               PIC X(1) OCCURS 8.
       01  OUT2-DATA-R REDEFINES OUT2-REC.
         05 OUT2-DATA-UP             PIC X(4).
         05 OUT2-DATA-DOWN           PIC X(4).
       01  WORK1-REC.
         05  WORK1-DATA              PIC X(1) OCCURS 8.
       01  WORK1-DATA-R REDEFINES WORK1-REC.
         05 WORK1-DATA-UP            PIC X(4).
         05 WORK1-DATA-DOWN          PIC X(4).
       01  WORK-AREA.
         05  WORK-HEX-UP             PIC 9(4)  COMP.
         05  WORK-HEX-DOWN           PIC 9(4)  COMP.
       01  HEX-CHG-BEF.
         05  HEX-CHANGE-LV           PIC X(1) VALUE LOW-VALUE.
         05  HEX-CHANGE-BEFORE       PIC X(1).
       01  HEX-CHG-AFT      REDEFINES  HEX-CHG-BEF.
         05  HEX-CHANGE-AFTER        PIC 9(4)  COMP.
       01  TBL-CHANGE-DATA.
          05  FILLER                 PIC  X(004) VALUE '0000'.
          05  FILLER                 PIC  X(001) VALUE '0'.
          05  FILLER                 PIC  X(004) VALUE '0001'.
          05  FILLER                 PIC  X(001) VALUE '1'.
          05  FILLER                 PIC  X(004) VALUE '0010'.
          05  FILLER                 PIC  X(001) VALUE '2'.
          05  FILLER                 PIC  X(004) VALUE '0011'.
          05  FILLER                 PIC  X(001) VALUE '3'.
          05  FILLER                 PIC  X(004) VALUE '0100'.
          05  FILLER                 PIC  X(001) VALUE '4'.
          05  FILLER                 PIC  X(004) VALUE '0101'.
          05  FILLER                 PIC  X(001) VALUE '5'.
          05  FILLER                 PIC  X(004) VALUE '0110'.
          05  FILLER                 PIC  X(001) VALUE '6'.
          05  FILLER                 PIC  X(004) VALUE '0111'.
          05  FILLER                 PIC  X(001) VALUE '7'.
          05  FILLER                 PIC  X(004) VALUE '1000'.
          05  FILLER                 PIC  X(001) VALUE '8'.
          05  FILLER                 PIC  X(004) VALUE '1001'.
          05  FILLER                 PIC  X(001) VALUE '9'.
          05  FILLER                 PIC  X(004) VALUE '1010'.
          05  FILLER                 PIC  X(001) VALUE 'A'.
          05  FILLER                 PIC  X(004) VALUE '1011'.
          05  FILLER                 PIC  X(001) VALUE 'B'.
          05  FILLER                 PIC  X(004) VALUE '1100'.
          05  FILLER                 PIC  X(001) VALUE 'C'.
          05  FILLER                 PIC  X(004) VALUE '1101'.
          05  FILLER                 PIC  X(001) VALUE 'D'.
          05  FILLER                 PIC  X(004) VALUE '1110'.
          05  FILLER                 PIC  X(001) VALUE 'E'.
          05  FILLER                 PIC  X(004) VALUE '1111'.
          05  FILLER                 PIC  X(001) VALUE 'F'.
          01  TBL-DATA REDEFINES TBL-CHANGE-DATA.
           05  TBL-CHG  OCCURS  16 TIMES.
             10  TBL-BIT-CHAR        PIC  X(004).
             10  TBL-HEX-CHAR        PIC  X(001).
       01 BIT-COUNT                  PIC 9(1).
       01 I                          PIC S9(8) COMP.
       LINKAGE SECTION.
       01 G-MASK.
         03 D-G-MASK                 PIC X(1) OCCURS 19.
       01 COM-MASK.
         03 D-COM-MASK               PIC X(1) OCCURS 19.
       01 O-ARG0.
         03 D-O-ARG0                 PIC X(1) OCCURS 19.
       01 BYTE-COUNT                 PIC S9(8) COMP.
       01 RTN01                      PIC 9(1).
       PROCEDURE DIVISION USING G-MASK COM-MASK O-ARG0 BYTE-COUNT
            RTN01.
            MOVE 0 TO RTN01
            PERFORM VARYING I FROM 1 BY 1 UNTIL I > BYTE-COUNT
              PERFORM ANDCOMMASK
              IF RTN01 = 1 THEN
                GOBACK
              END-IF
            END-PERFORM.
            EXIT PROGRAM.
       ANDCOMMASK.
      * CONVERT GROUP COMMON MASK TO BIT
            MOVE D-COM-MASK(I) TO HEX-CHANGE-BEFORE.
            DIVIDE 16 INTO HEX-CHANGE-AFTER GIVING WORK-HEX-UP
                                         REMAINDER WORK-HEX-DOWN.
            MOVE TBL-BIT-CHAR(WORK-HEX-UP + 1)   TO OUT1-DATA-UP.
            MOVE TBL-BIT-CHAR(WORK-HEX-DOWN + 1) TO OUT1-DATA-DOWN.
      * CONVERT OPTION IN ARG0 TO BIT
            MOVE D-O-ARG0(I) TO HEX-CHANGE-BEFORE.
            DIVIDE 16 INTO HEX-CHANGE-AFTER GIVING WORK-HEX-UP
                                         REMAINDER WORK-HEX-DOWN.
            MOVE TBL-BIT-CHAR(WORK-HEX-UP + 1)   TO OUT2-DATA-UP.
            MOVE TBL-BIT-CHAR(WORK-HEX-DOWN + 1) TO OUT2-DATA-DOWN.
      * CREATE EVAL BIT FROM GROUP COMMON MASK BIT AND ARG0 BIT
            PERFORM VARYING BIT-COUNT FROM 1 BY 1 UNTIL BIT-COUNT > 8
              IF OUT1-DATA(BIT-COUNT) = '1' AND
                 OUT2-DATA(BIT-COUNT) = '1' THEN
                MOVE '1' TO WORK1-DATA(BIT-COUNT)
              ELSE
                MOVE '0' TO WORK1-DATA(BIT-COUNT)
              END-IF
            END-PERFORM.
      * CONVERT GROUP MASK TO BIT DATA
            MOVE D-G-MASK(I) TO HEX-CHANGE-BEFORE.
            DIVIDE 16 INTO HEX-CHANGE-AFTER GIVING WORK-HEX-UP
                                         REMAINDER WORK-HEX-DOWN.
            MOVE TBL-BIT-CHAR(WORK-HEX-UP + 1)   TO OUT1-DATA-UP.
            MOVE TBL-BIT-CHAR(WORK-HEX-DOWN + 1) TO OUT1-DATA-DOWN.
      * CHECK IF EQUAL BETWEEN EVAL BIT AND GROUP MASK BIT
            IF WORK1-DATA-UP = OUT1-DATA-UP AND
               WORK1-DATA-DOWN = OUT1-DATA-DOWN THEN
              CONTINUE
            ELSE
              MOVE 1 TO RTN01
            END-IF
            EXIT.
       END PROGRAM 'EVALOPT'.
      *+---------------------------------------------------------------+
      *| GTMEMRC                                                       |
      *|     GET DATA AREA FOR RECORD COUNT OF CICS/DB2 GROUP          |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'GTMEMRC'.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 BZUGTMEM            PIC X(8) VALUE 'BZUGTMEM'.
       01 DATA-SIZE           PIC 9(8) COMP-4.
       LINKAGE SECTION.
       01 TC-WORK-AREA        PIC X(256).
       01 AZ-GRP-INDEX        PIC 9(8).
       01 AZ-FLAG-IN          PIC 9(1).
       01 AZ-RECORD-PTR       POINTER.
       01 AZ-RECORD-PTR-VALUE
            REDEFINES AZ-RECORD-PTR  PIC S9(9) COMP-5.
       01 DATA-PTR            POINTER.
       01 DATA-PTR-VALUE
            REDEFINES DATA-PTR  PIC S9(9) COMP-5.
       01 DATA-AREA.
         03 RECORD-COUNT-IO OCCURS 6.
           05 RECORD-COUNT-OT PIC 9(5) COMP-5.
           05 RECORD-COUNT-IN PIC 9(5) COMP-5.
       01 WK-RECORD-COUNT     PIC 9(5) COMP-5.
       PROCEDURE DIVISION USING TC-WORK-AREA AZ-GRP-INDEX AZ-FLAG-IN
           AZ-RECORD-PTR.
           SET ADDRESS OF DATA-PTR TO ADDRESS OF TC-WORK-AREA.
           IF DATA-PTR-VALUE = 0 THEN
             COMPUTE DATA-SIZE = LENGTH OF WK-RECORD-COUNT * 2 * 6
             CALL BZUGTMEM USING DATA-SIZE RETURNING DATA-PTR
             SET ADDRESS OF DATA-AREA TO DATA-PTR
             DISPLAY 'AREA ALLOCATED FOR RECORD COUNT:' DATA-SIZE
           END-IF
           SET AZ-RECORD-PTR TO DATA-PTR
           COMPUTE AZ-RECORD-PTR-VALUE = AZ-RECORD-PTR-VALUE +
                 LENGTH OF WK-RECORD-COUNT * 2 * (AZ-GRP-INDEX - 1)
           IF AZ-FLAG-IN = 1 THEN
             ADD LENGTH OF WK-RECORD-COUNT TO AZ-RECORD-PTR-VALUE
           END-IF
           SET ADDRESS OF WK-RECORD-COUNT TO AZ-RECORD-PTR
           GOBACK.
       END PROGRAM 'GTMEMRC'.
      *+---------------------------------------------------------------+
      *| AZU_GENERIC_CICS                                              |
      *|   GENERIC CICS CALLBACK EXIT POINT                            |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'AZU_GENERIC_CICS'.
       PROCEDURE DIVISION.
      * CHECK OUTPUT VALUE
      * CICS_INPT.
           ENTRY 'CICS_INPT'.
           DISPLAY 'CICS_INPT ...'
           MOVE 4 TO RETURN-CODE.
           GOBACK.
      * CICS_OUTP.
           ENTRY 'CICS_OUTP'.
           DISPLAY 'CICS_OUTP ...'
           MOVE 4 TO RETURN-CODE.
           GOBACK.
      * CICS_INPT_0E08 FOR RETURN.
           ENTRY 'CICS_INPT_0E08'.
           DISPLAY 'CICS_INPT_0E08 ...'
           MOVE 0 TO RETURN-CODE.
           GOBACK.
       END PROGRAM 'AZU_GENERIC_CICS'.
      *+---------------------------------------------------------------+
      *| AZU_GENERIC_DB2                                               |
      *|   GENERIC DB2 CALLBACK EXIT POINT                             |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'AZU_GENERIC_DB2'.
       PROCEDURE DIVISION.
      * CHECK OUTPUT VALUE
      * DB2_INPT.
           ENTRY 'DB2_INPT'.
           DISPLAY 'DB2_INPT ...'
           MOVE 4 TO RETURN-CODE.
           GOBACK.
      * DB2_OUTP.
           ENTRY 'DB2_OUTP'.
           DISPLAY 'DB2_OUTP ...'
           MOVE 4 TO RETURN-CODE.
           GOBACK.
       END PROGRAM 'AZU_GENERIC_DB2'.
      *+---------------------------------------------------------------+
      *| PROGRAM FOR EXEC CICS RETURN                                  |
      *|    FUNCTION CODE: 0E08                                        |
      *|                                                               |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'CICS_0E08_HCMADB02'.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 BZ-ASSERT.
         03 MESSAGE-LEN PIC S9(4) COMP-4 VALUE 24.
         03 MESSAGE-TXT PIC X(254) VALUE 'HELLO FROM CICS CALLBACK'.
       01  BZ-P1 PIC S9(9) COMP-4 VALUE 4.
       01  BZ-P2 PIC S9(9) COMP-4 VALUE 2001.
       01  BZ-P3 PIC X(3) VALUE 'AZU'.
       01 BZ-TRACE.
         03 TRACE-LEN       PIC S9(4) COMP-4 VALUE 5.
         03 TRACE-TXT       PIC X(254) VALUE 'TRACE'.
       01 BZUASSRT          PIC X(8) VALUE 'BZUASSRT'.
       01 BZUTRACE          PIC X(8) VALUE 'BZUTRACE'.
       01 AZ-TRACE-PTR      POINTER.
       01 AZ-TEST-LEN       PIC S9(8) COMP.
       01 AZ-RECORD.
         03 AZ-RECORD-COUNT-OT OCCURS 1 PIC 9(5) COMP-5 VALUE 0.
         03 AZ-RECORD-COUNT-IN OCCURS 1 PIC 9(5) COMP-5 VALUE 0.
       01 AZ-GRP-INDEX       PIC 9(8).
       01 AZ-FLAG-IN         PIC 9(1).
       01 AZ-RECORD-PTR      POINTER.
       01 AZ-OPT-MASK-DATA2  PIC X(2).
       01 AZ-OPT-MASK-DATA9  PIC X(9).
       01 AZ-OPT-MASK-DATA11 PIC X(11).
       01 AZ-OPT-MASK-DATA19 PIC X(19).
       01 AZ-OPT-BYTECOUNT   PIC S9(8) COMP.
       01 AZ-OPT-RC          PIC 9(1) VALUE 0.
       01 AZ-OPT-COMMASK.
         03  AZ-OPT-COMMASK-DATA2  PIC X(2) OCCURS 1.
         03  AZ-OPT-COMMASK-DATA9  PIC X(9) OCCURS 1.
         03  AZ-OPT-COMMASK-DATA11 PIC X(11) OCCURS 1.
         03  AZ-OPT-COMMASK-DATA19 PIC X(19) OCCURS 1.
       01 AZ-LINE-BYTE      PIC S9(2) COMP.
       01 AZ-LINE-NUM       PIC 9(5).
       01 AZ-LINE-NUM-R   REDEFINES AZ-LINE-NUM.
         03 AZ-LINE-NUM-RD  PIC 9(1) OCCURS 5.
       01 AZ-LINE-I         PIC S9(8) COMP.
       01 AZ-LINE-J         PIC S9(8) COMP.
       LOCAL-STORAGE SECTION.
       LINKAGE SECTION.
       01 AZ-TEST                   PIC X(80).
       01 AZ-INFO-BLOCK.
          COPY BZUITERC.
       01 AZ-WK-RECORD-COUNT PIC 9(5) COMP-5.
       01 AZ-MODX                   PIC X(4).
       01 AZ-DFHEIBLK.
         03 FILLER                  PIC X(85).
       01 AZ-DFHCOMMAREA.
         03 FILLER                  PIC X(1).
       01 ARG0.
         03 ARG0-1        PIC X(2).
         03 ARG0-A        PIC X(28).
         03 ARG0-B REDEFINES ARG0-A.
           05 ARG0-2      PIC X(9).
           05 FILLER      PIC X(19).
         03 ARG0-C REDEFINES ARG0-A.
           05 FILLER      PIC X(6).
           05 ARG0-D.
             07 ARG0-3    PIC 9(1) OCCURS 22.
       01 ARG1            POINTER.
       01 ARG2            POINTER.
       01 ARG3            POINTER.
       01 ARG4            POINTER.
       01 ARG5            POINTER.
       01 ARG6            POINTER.
       01 ARG7            POINTER.
       01 ARG8            POINTER.
       01 ARG9            POINTER.
       01 ARG10           POINTER.
       01 AZ-CICS-TARGET-NAME-DEF4 PIC X(4).
       01 AZ-CICS-TARGET-NAME-DEF7 PIC X(7).
       01 AZ-CICS-TARGET-NAME-DEF8 PIC X(8).
       PROCEDURE DIVISION.
      * CHECK OUTPUT VALUE
      * CICS_INPT_0E08_HCMADB02.
           ENTRY 'CICS_INPT_0E08_HCMADB02' USING AZ-TEST
           AZ-INFO-BLOCK AZ-DFHEIBLK AZ-DFHCOMMAREA ARG0 ARG1 ARG2
           ARG3 ARG4 ARG5 ARG6 ARG7 ARG8 ARG9 ARG10.
           DISPLAY 'CICS_0E08_HCMADB02 CHECK VALUES...'
           MOVE 4 TO RETURN-CODE.
           MOVE 0 TO AZ-TEST-LEN.
           INSPECT AZ-TEST TALLYING AZ-TEST-LEN FOR
           CHARACTERS BEFORE INITIAL SPACE.
      * SET GROUP OPTION COMMON MASK IN CICS GROUP
           MOVE X'0000' TO AZ-OPT-COMMASK-DATA2(1).
      * EXEC CICS RETURN X'0000'
           IF ARG0-1 = X'0E08'
             MOVE X'0000' TO AZ-OPT-MASK-DATA2
             MOVE 2 TO AZ-OPT-BYTECOUNT
             CALL 'EVALOPT' USING AZ-OPT-MASK-DATA2
               AZ-OPT-COMMASK-DATA2(1) ARG0-2
               AZ-OPT-BYTECOUNT AZ-OPT-RC
             IF AZ-OPT-RC = 0 THEN
               MOVE 3 TO AZ-LINE-BYTE
               PERFORM GETLINENUM
               DISPLAY 'EXEC CICS RETURN X''0000'''
                ' L=' AZ-LINE-NUM
               MOVE 2 TO AZ-GRP-INDEX
               MOVE 0 TO AZ-FLAG-IN
               CALL 'GTMEMRC' USING TC-WORK-AREA OF AZ-INFO-BLOCK
                 AZ-GRP-INDEX AZ-FLAG-IN AZ-RECORD-PTR
               SET ADDRESS OF AZ-WK-RECORD-COUNT TO AZ-RECORD-PTR
               ADD 1 TO AZ-WK-RECORD-COUNT
               MOVE AZ-WK-RECORD-COUNT TO AZ-RECORD-COUNT-OT(1)
               EVALUATE AZ-TEST(1:AZ-TEST-LEN)
                 WHEN SPACE
                   CONTINUE
                 WHEN 'TEST3'
                   PERFORM O0E080-TEST3
                   CONTINUE
                 WHEN 'TEST4'
                   PERFORM O0E080-TEST4
                   CONTINUE
                 WHEN OTHER
                   CONTINUE
                 END-EVALUATE
             END-IF
           END-IF.
           PERFORM TEARDOWN.
      * SET INPUT VALUE
      * CICS_OUTP_0E08_HCMADB02.
           ENTRY 'CICS_OUTP_0E08_HCMADB02' USING AZ-TEST
           AZ-INFO-BLOCK AZ-DFHEIBLK AZ-DFHCOMMAREA ARG0 ARG1 ARG2
           ARG3 ARG4 ARG5 ARG6 ARG7 ARG8 ARG9 ARG10.
           DISPLAY 'CICS_0E08_HCMADB02 INPUT VALUES...'
           MOVE 0 TO RETURN-CODE.
           MOVE 0 TO AZ-TEST-LEN.
           INSPECT AZ-TEST TALLYING AZ-TEST-LEN FOR
           CHARACTERS BEFORE INITIAL SPACE.
      * SET GROUP OPTION COMMON MASK IN CICS GROUP
           MOVE X'0000' TO AZ-OPT-COMMASK-DATA2(1).
      * EXEC CICS RETURN X'0000'
           IF ARG0-1 = X'0E08'
             MOVE X'0000' TO AZ-OPT-MASK-DATA2
             MOVE 2 TO AZ-OPT-BYTECOUNT
             CALL 'EVALOPT' USING AZ-OPT-MASK-DATA2
               AZ-OPT-COMMASK-DATA2(1) ARG0-2
               AZ-OPT-BYTECOUNT AZ-OPT-RC
             IF AZ-OPT-RC = 0 THEN
               MOVE 3 TO AZ-LINE-BYTE
               PERFORM GETLINENUM
               DISPLAY 'EXEC CICS RETURN X''0000'''
                ' L=' AZ-LINE-NUM
               MOVE 2 TO AZ-GRP-INDEX
               MOVE 1 TO AZ-FLAG-IN
               CALL 'GTMEMRC' USING TC-WORK-AREA OF AZ-INFO-BLOCK
                 AZ-GRP-INDEX AZ-FLAG-IN AZ-RECORD-PTR
               SET ADDRESS OF AZ-WK-RECORD-COUNT TO AZ-RECORD-PTR
               ADD 1 TO AZ-WK-RECORD-COUNT
               MOVE AZ-WK-RECORD-COUNT TO AZ-RECORD-COUNT-IN(1)
               EVALUATE AZ-TEST(1:AZ-TEST-LEN)
                 WHEN SPACE
                   CONTINUE
                 WHEN 'TEST3'
                   CONTINUE
                 WHEN 'TEST4'
                   CONTINUE
                 WHEN OTHER
                   CONTINUE
                 END-EVALUATE
             END-IF
           END-IF.
           PERFORM TEARDOWN.
       O0E080-TEST3.
           IF AZ-RECORD-COUNT-OT(1) = 0 THEN
             CONTINUE
           ELSE
             CONTINUE
           END-IF.
       O0E080-TEST4.
           IF AZ-RECORD-COUNT-OT(1) = 0 THEN
             CONTINUE
           ELSE
             CONTINUE
           END-IF.
       GETLINENUM.
           MOVE 1 TO AZ-LINE-J
           PERFORM VARYING AZ-LINE-I FROM AZ-LINE-BYTE BY 1
             UNTIL AZ-LINE-I > AZ-LINE-BYTE + 5
             MOVE ARG0-3(AZ-LINE-I) TO AZ-LINE-NUM-RD(AZ-LINE-J)
             ADD 1 TO AZ-LINE-J
           END-PERFORM
           EXIT.
       TEARDOWN.
           DISPLAY 'CICS_0E08_HCMADB02 SUCCESSFUL.'
           GOBACK.
       END PROGRAM 'CICS_0E08_HCMADB02'.
